In [7]:
import pandas as pd
import numpy as np

In [8]:
pwd

'C:\\Users\\LENOVO\\Desktop\\q'

In [9]:
makanan = pd.read_csv(r"makanan.csv")
ratings = pd.read_csv(r"rating.csv")

In [10]:
makanan.head()

   idmakanan         nama       daerah
0          1  Nasi Goreng      Jakarta
1          2     Mie Ayam      Jakarta
2          3         Sate  Solo,Madura
3          4        Pecel      Jakarta
4          5        Gulai  Solo,Madura

In [11]:
ratings.head()

   userid  idmakanan  nilai
0       1          1      9
1       1          2      7
2       1          3      9
3       1          4      7
4       1          5      4

In [12]:
def replace_name(x):
	return makanan[makanan['idmakanan']==x].nama.values[0]
ratings.idmakanan = ratings.idmakanan.map(replace_name)

In [13]:
ratings.head()

   userid    idmakanan  nilai
0       1  Nasi Goreng      9
1       1     Mie Ayam      7
2       1         Sate      9
3       1        Pecel      7
4       1        Gulai      4

In [14]:
M = ratings.pivot_table(index=['userid'],columns=['idmakanan'],values='nilai')

In [15]:
M.shape

(10, 5)

In [16]:
M

idmakanan  Gulai  Mie Ayam  Nasi Goreng  Pecel  Sate
userid
1              4         7            9      7     9
2             10         5            2      5     1
3             10         1            6      6     4
4              3         8            6      9     9
5              1         2            7      7     5
6              5         6           10      7     2
7              4         5            6     10     4
8              8         7           10      1     7
9              6         1            1      5     2
10             1         7            6      7    10

In [17]:
def pearson(s1, s2):
        s1_c = s1 - s1.mean()
        s2_c = s2 - s2.mean()
        return np.sum(s1_c * s2_c) / np.sqrt(np.sum(s1_c ** 2) * np.sum(s2_c ** 2))

In [18]:
pearson(M['Nasi Goreng'],M['Sate'])

0.4289352155830237

In [19]:
def get_recs(makanan_name, M, num):
    
    import numpy as np
    
    reviews = []
    for nama in M.columns:
        if nama == makanan_name:
            continue
        cor = pearson(M[makanan_name], M[nama])
        if np.isnan(cor):
            continue
        else:
            reviews.append((nama, cor))
                
    reviews.sort(key=lambda tup: tup[1], reverse=True)
    return reviews[:num]

In [20]:
recs = get_recs('Nasi Goreng' , M,10)

In [22]:
recs[:10]

[('Mie Ayam', 0.4912219944665885),
 ('Sate', 0.4289352155830237),
 ('Pecel', -0.06284608985075577),
 ('Gulai', -0.23012867289006045)]